In [1]:
import numpy as np
import pandas as pd

In [10]:
df1 = pd.DataFrame({'c1':[1,1,1,0,3,0],'c2':[0,1,1,0,4,0]})
df1

   c1  c2
0   1   0
1   1   1
2   1   1
3   0   0
4   3   4
5   0   0

In [12]:
df1.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [13]:
print("Duplicated")
df1[df1.duplicated()]

Duplicated

   c1  c2
2   1   1
5   0   0

In [14]:
df1.drop_duplicates()

   c1  c2
0   1   0
1   1   1
3   0   0
4   3   4

In [16]:
df1.drop_duplicates(['c1'])

   c1  c2
0   1   0
3   0   0
4   3   4

In [19]:
df1.drop_duplicates(['c2'], keep='last') #last : Drop duplicates except for the last occurrence.

   c1  c2
2   1   1
4   3   4
5   0   0